<template>
  <div>
    <table>
      <tr>
        <th>วัน/เวลา</th>
        <td class="time" v-for="t in 10" :key="t">{{ t }}</td>
      </tr>
      <tr v-for="day in days" :key="day">
        <td>{{ day }}</td>
      </tr>
    </table>
  </div>
</template>

<script>
export default {
  data() {
    return {
      days: [
        "วันจันทร์",
        "วันอังคาร",
        "วันพุธ",
        "วันพฤหัสบดี",
        "วันศุกร์",
        "วันเสาร์",
        "วันอาทิตย์",
      ],
      times: [
          "05:45-06:35",
          "06:40-07:30",
          "07:35-08:30",
          "08:35-09:20",
          "09:25-10:15",
          "10:20-11:10",
          "11:15-12:05",
          "--",
          "13:00-13:50",
          "13:55-14:45",
          "14:50-15:40",
          "15:45-16:35",
          "16:40-17:30",
          "17:35-18:25",
          "18:30-19:20",
          "19:25-20:15",
      ]
    };
  },methods: {
      
  },
};
</script>

<style scoped></style>
